# 01

### DataFrame 살펴보기
- 판다스에서 데이터를 저장하는 자료형
- 구성 : 2차원 데이터를 저장 (인덱스 + 열이름 + 데이터)
- 형식 : pandas.DataFrame

In [307]:
# 모듈 로딩
import pandas as pd

In [308]:
# 데이터 준비
jumsu = [[98, 99, 100], [67, 81, 80]]

In [309]:
# DF으로 데이터 저장하기
jumsuDF = pd.DataFrame(jumsu)
jumsuDF

    0   1    2
0  98  99  100
1  67  81   80

In [310]:
# DF 속성 읽기 ==> 변수명.속성명
# - index, columns, values, ndim, dtypes

print(f'index   : {jumsuDF.index}')
print(f'columns : {jumsuDF.columns}')
print(f'values : \n{jumsuDF.values}')
print(f'dtypes : {type(jumsuDF.dtypes)} \n{jumsuDF.dtypes}')
print(f'ndim : {jumsuDF.ndim}')
print(f'shape : {jumsuDF.shape}')

index   : RangeIndex(start=0, stop=2, step=1)
columns : RangeIndex(start=0, stop=3, step=1)
values :
[[ 98  99 100]
 [ 67  81  80]]
dtypes : <class 'pandas.core.series.Series'>
0    int64
1    int64
2    int64
dtype: object
ndim : 2
shape : (2, 3)

In [311]:
for i in jumsuDF.index:
    for j in jumsuDF.columns:
        print(jumsu[i][j])

98
99
100
67
81
80

- DataFrame 생성 시 인덱스 지정 <hr>

In [312]:
index_value = ['A', 'B']
column_value = ['국어', '과학', '미술']
df2 = pd.DataFrame(jumsu, index = index_value, columns = column_value)
df2

   국어  과학   미술
A  98  99  100
B  67  81   80

In [313]:
# DF 인덱스 속성 읽기 ==> 변수명.index
print(df2.index, type(df2.index), sep = '\n')

Index(['A', 'B'], dtype='object')
<class 'pandas.core.indexes.base.Index'>

In [314]:
# DF 인덱스 속성 읽기 ==> 변수명.index
print(df2.columns, type(df2.columns), sep = '\n')

Index(['국어', '과학', '미술'], dtype='object')
<class 'pandas.core.indexes.base.Index'>

# 02

### DataFrame 살펴보기
- Dict 데이터로 DF 저장

In [315]:
# 모듈 로딩
import pandas as pd

In [316]:
# 데이터 준비
jumsu = {'국어' : [89, 91], '수학' : [88, 90], '음악' : [100, 98]}

In [317]:
# DF으로 데이터 저장
df1 = pd.DataFrame(jumsu)

In [318]:
# DF로 저장된 데이터 확인
df1

   국어  수학   음악
0  89  88  100
1  91  90   98

- [속성으로 행 인덱스 변경] : 변수명.index = 새로운 인덱스

In [319]:
# 0, 1 인덱스 ===> '마징가', '홍길동
df1.index=['마징가', '홍길동']
df1

     국어  수학   음악
마징가  89  88  100
홍길동  91  90   98

In [320]:
# 컬럼 인덱스 ===> '국어', '미술', '과학'
df1.columns = ['국어', '미술', '과학']
df1

     국어  미술   과학
마징가  89  88  100
홍길동  91  90   98

In [321]:
# 값/데이터 변경은 속성으로는 불가!!!
# df1.values = [[89, 78, 100], [92,90,98]]

# 03

### DataFram에서 원소/요소 읽기
- 행 읽기 / 열 읽기
- 행과 열이 교차하는 지점 원소/요소 읽기

In [322]:
# 모듈 로딩
import pandas as pd

In [323]:
# 데이터 준비
jumsu = [[98, 99, 100], [67, 81, 80]]

In [324]:
# 2D 데이터를 DF으로 저장
df1 = pd.DataFrame(jumsu)
df1

    0   1    2
0  98  99  100
1  67  81   80

In [325]:
# 행 인덱스와 열 인덱스 속성으로 지정
# 행 인덱스 => 김경태, 안효준
# 열 인덱스 => 음악, 영어, 무용

In [326]:
df1.index = ['김경태', '안효준']
df1.columns = ['음악', '영어', '무용']
df1

     음악  영어   무용
김경태  98  99  100
안효준  67  81   80

- [열/컬럼 선택] : 변수명[컬럼명/컬럼인덱스]

In [327]:
# 영어 과목 점수만 추출
print(df1['영어'], type(df1['영어']), sep = '\n\n')

김경태    99
안효준    81
Name: 영어, dtype: int64

<class 'pandas.core.series.Series'>

In [328]:
# 무용 과목 점수만 추출
df1.무용    # df1['무용']

김경태    100
안효준     80
Name: 무용, dtype: int64

In [329]:
# df1['음악':'무용'] # 이건 못가져옴

In [330]:
df1.columns

Index(['음악', '영어', '무용'], dtype='object')

In [331]:
print(df1.columns[::2])

Index(['음악', '무용'], dtype='object')

In [332]:
df1[df1.columns]

     음악  영어   무용
김경태  98  99  100
안효준  67  81   80

- [행/로우 선택] : 변수명.iloc[행인덱스], 변수명.loc[행인덱스]

In [333]:
df1

     음악  영어   무용
김경태  98  99  100
안효준  67  81   80

In [334]:
# 변수명.iloc[정수인덱스]
df1.iloc[0]

음악     98
영어     99
무용    100
Name: 김경태, dtype: int64

In [335]:
# 변수명.loc[문자인덱스]
df1.loc['김경태']

음악     98
영어     99
무용    100
Name: 김경태, dtype: int64

In [336]:
# 여러개 . 행추출
df1.loc[['안효준', '김경태']]

     음악  영어   무용
안효준  67  81   80
김경태  98  99  100

In [337]:
print(df1.index, df1.index[1:], df1.index[::-1], sep = '\n')

Index(['김경태', '안효준'], dtype='object')
Index(['안효준'], dtype='object')
Index(['안효준', '김경태'], dtype='object')

In [338]:
df1.loc[df1.index[::-1]]

     음악  영어   무용
안효준  67  81   80
김경태  98  99  100

- [원소/요소 추출] : 변수명.iloc[정수인덱스][열인덱스], 변수명.loc[행인덱스][열인덱스]

In [339]:
df1.loc['김경태']

음악     98
영어     99
무용    100
Name: 김경태, dtype: int64

In [340]:
df1.loc['김경태']['영어']

99

In [341]:
df1.iloc[0]

음악     98
영어     99
무용    100
Name: 김경태, dtype: int64

In [342]:
df1.iloc[0]['영어']

99

In [343]:
# df1.iloc[0][1] # 작동은 하는데 추후에 사라질 코드

- [원소/요소 추출] : 변수명.iloc[정수인덱스, 열인덱스], 변수명.loc[행인덱스, 열인덱스]

In [344]:
# 김경태님의 영어 점수만 출력
df1.iloc[0,1] # df1.iloc[정수, 정수]

# df1.iloc[0, '영어'] 이건 안됨

99

In [345]:
df1.loc['김경태', '영어']

99

In [346]:
# [문] 김경태님의 영어, 무용 점수 추출
df1.loc['김경태', ['영어', '무용']]

영어     99
무용    100
Name: 김경태, dtype: int64

In [347]:
df1.iloc[0][1:]

영어     99
무용    100
Name: 김경태, dtype: int64

In [348]:
df1.iloc[0]['영어':]

영어     99
무용    100
Name: 김경태, dtype: int64

In [349]:
df1.loc['김경태']['영어':]

영어     99
무용    100
Name: 김경태, dtype: int64

# 04

### DataFrame 행/열 인덱스 변경
- 방법1 : 속성명으로 변경 ==> 전체 변경
- 방법2 : 메서드로 변경 ==> 일부 변경

In [350]:
# 모듈 로딩
import pandas as pd

In [351]:
# 데이터 준비
data = {'name'   : ['홍길동', '마징가', '원더우먼'],
        'job'    : ['의적', '로봇', '영웅'],
        'gender' : ['남', '남', '여'],
        'age'    : [100, 200, 300],
        'height' : [180, 300, 200]}

In [352]:
dataDF = pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [353]:
# [실습] 열 인덱스를 이름, 직업, 성별, 나이, 키
dataDF.columns = ['이름', '직업', '성별', '나이', '키']
dataDF

     이름  직업 성별   나이    키
0   홍길동  의적  남  100  180
1   마징가  로봇  남  200  300
2  원더우먼  영웅  여  300  200

In [354]:
# [실습] 행 인덱스 0, 1, 2 ===> P0, P1, P2로 변경
dataDF.index = ['P0', 'P1', 'P2']
dataDF

      이름  직업 성별   나이    키
P0   홍길동  의적  남  100  180
P1   마징가  로봇  남  200  300
P2  원더우먼  영웅  여  300  200

In [355]:
# [실습] 일부변경 : 키 ---> 신장 변경
newDF = dataDF.rename(columns = {'키' : '신장'}) # inplace = True는 원본 변경시키는 것

In [356]:
newDF

      이름  직업 성별   나이   신장
P0   홍길동  의적  남  100  180
P1   마징가  로봇  남  200  300
P2  원더우먼  영웅  여  300  200

In [357]:
dataDF

      이름  직업 성별   나이    키
P0   홍길동  의적  남  100  180
P1   마징가  로봇  남  200  300
P2  원더우먼  영웅  여  300  200

In [358]:
# => inplace 매개변수/파라미터 True 설정 : 원본 DF을 변경
dataDF.rename(columns = {'키' : '신장'}, inplace = True)
dataDF

      이름  직업 성별   나이   신장
P0   홍길동  의적  남  100  180
P1   마징가  로봇  남  200  300
P2  원더우먼  영웅  여  300  200

In [359]:
# [실습] 행 인덱스 P2 ==> END로 변경
dataDF.rename(index = {'P2' : 'END'})

       이름  직업 성별   나이   신장
P0    홍길동  의적  남  100  180
P1    마징가  로봇  남  200  300
END  원더우먼  영웅  여  300  200

# 05

### DataFrame에서 행/열 삭제

In [360]:
# 데이터 준비
data = {'name'   : ['홍길동', '마징가', '원더우먼'],
        'job'    : ['의적', '로봇', '영웅'],
        'gender' : ['남', '남', '여'],
        'age'    : [100, 200, 300],
        'height' : [180, 300, 200]}

In [361]:
# DF으로 데이터 저장
dataDF = pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- [실습] 행 삭제 : 변수명.drop()메서드
    * 변수명.drop(labels, axis = 0) : axis의 설정 값에 따라 행 또는 열 삭제 진행
    * 변수명.drop(index) : 지정된 인덱스의 . 행 삭제

In [362]:
# [실습] 1번행 삭제 (기본값 : 행 삭제)
dataDF.drop(index = 1)

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우먼  영웅      여  300     200

In [363]:
# [실습] 2개 행 삭제
dataDF.drop(index = [0, 2])

  name job gender  age  height
1  마징가  로봇      남  200     300

- [실습] 열/컬럼 삭제 : 변수명.drop()메서드
    * 변수명.drop(labels, axis = 0) : axis의 설정 값에 따라 행 또는 열 삭제 진행
    * 변수명.drop(index) : 지정된 인덱스의 . 행 삭제

In [364]:
# [실습] 열/컬럼 삭제 : 변수명.drop( , axis = 1)메서드
# 삭제 방향 즉, 기준을 열로 설정 필수

# age 컬럼을 삭제
dataDF.drop(columns = 'age')

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [365]:
dataDF.drop('age', axis = 1)

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [366]:
dataDF.drop('age', axis = 'columns')

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [367]:
# gender, height 컬럼 삭제
dataDF.drop(columns = ['gender', 'height'])

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300

In [368]:
dataDF.drop(['gender', 'height'], axis = 1)

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300

# 06

### DataFrame에서 행/열 추가
- 행 방향 추가
- 열 방향 추가

In [369]:
import pandas as pd

In [370]:
# 데이터 준비
data = {'name'   : ['홍길동', '마징가', '원더우먼'],
        'job'    : ['의적', '로봇', '영웅'],
        'gender' : ['남', '남', '여'],
        'age'    : [100, 200, 300],
        'height' : [180, 300, 200]}

In [371]:
# DF으로 데이터 저장
dataDF = pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- [실습] 행 추가 : 변수명.loc['추가할 행이름'] = 데이터
    * 변수명.iloc[] X
    * 데이터 수 == 컬럼 수 경우, 행 추가 가능
    * 데이터 수 == 1개 경우, 행 추가 가능
    * 그 외의 경우, 행 추가 X

In [372]:
# 1개 행 추가
dataDF.loc[3] = ['배트맨', '박쥐', '남', 40, 190]
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200
3   배트맨  박쥐      남   40     190

In [373]:
dataDF.loc[4] = ['배트맨', '박쥐', '남', 40, 190]

In [374]:
# 1개 행 추가 => 데이터 수를 1개로 => 모든 컬럼에 동일한 값 저장
dataDF.loc[5] = 100
dataDF

   name  job gender  age  height
0   홍길동   의적      남  100     180
1   마징가   로봇      남  200     300
2  원더우먼   영웅      여  300     200
3   배트맨   박쥐      남   40     190
4   배트맨   박쥐      남   40     190
5   100  100    100  100     100

In [375]:
# 1개 행 추가 => 데이터 수를 2개로 => ERROR
# dataDF.loc[6] = ['스파이더맨', '거미']
# dataDF

- [실습] 열 추가 : 변수명['추가할 열이름'] = 데이터
    * 데이터 수 == 행 수 경우, 열 추가 가능
    * 데이터 수 == 1개 경우, 열 추가 가능
    * 그 외의 경우, 열 추가 X

In [376]:
dataDF

   name  job gender  age  height
0   홍길동   의적      남  100     180
1   마징가   로봇      남  200     300
2  원더우먼   영웅      여  300     200
3   배트맨   박쥐      남   40     190
4   배트맨   박쥐      남   40     190
5   100  100    100  100     100

In [377]:
# 컬럼/열 추가 => weight 추가 : 행 개수 == 데이터 개수
dataDF['weight'] = [90, 100, 80, 78, 78, 90]
dataDF

   name  job gender  age  height  weight
0   홍길동   의적      남  100     180      90
1   마징가   로봇      남  200     300     100
2  원더우먼   영웅      여  300     200      80
3   배트맨   박쥐      남   40     190      78
4   배트맨   박쥐      남   40     190      78
5   100  100    100  100     100      90

In [379]:
# 컬럼/열 추가 => weight 추가 : 1 개수 == 데이터 개수
dataDF['weight2'] = 0
dataDF

   name  job gender  age  height  weight  weight2
0   홍길동   의적      남  100     180      90        0
1   마징가   로봇      남  200     300     100        0
2  원더우먼   영웅      여  300     200      80        0
3   배트맨   박쥐      남   40     190      78        0
4   배트맨   박쥐      남   40     190      78        0
5   100  100    100  100     100      90        0

In [380]:
# not match length ERROR
# dataDF['weight3'] = [0, 90]
# dataDF

In [381]:
dataDF['weight'] = 100

In [382]:
dataDF

   name  job gender  age  height  weight  weight2
0   홍길동   의적      남  100     180     100        0
1   마징가   로봇      남  200     300     100        0
2  원더우먼   영웅      여  300     200     100        0
3   배트맨   박쥐      남   40     190     100        0
4   배트맨   박쥐      남   40     190     100        0
5   100  100    100  100     100     100        0

# 07

### DataFrame에서 원소/요소 데이터 변경

In [383]:
# 모듈 로딩
import pandas as pd

In [384]:
# 데이터 준비
data = {'name'   : ['홍길동', '마징가', '원더우먼'],
        'job'    : ['의적', '로봇', '영웅'],
        'gender' : ['남', '남', '여'],
        'age'    : [100, 200, 300],
        'height' : [180, 300, 200]}

In [385]:
dataDF = pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- [원소/요소 값 변경]

In [386]:
# 홍길동의 성별을 '남' ===> '여'
dataDF.iloc[0, 2] = '여'
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [387]:
# 원더우먼의 직업을 직장인으로 변경
dataDF.iloc[2, 1] = '직장인'
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우먼  직장인      여  300     200

- [행 전체 값 변경]

In [45]:
# 행 전체 선택 => 변수명.iloc[] / 변수명.loc[]
# 1번행 추출
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [46]:
# 1번 행 값 변경 => 컬럼 수 == 데이터 수
dataDF.iloc[1] = ['마징가2', '영웅', '여자', 90, 170]
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1  마징가2  영웅     여자   90     170
2   직장인  영웅      여  300     200

In [47]:
# 1번 행 값 변경 => 1개 == 데이터 수
dataDF.iloc[1] = 0
dataDF

  name job gender  age  height
0  홍길동  의적      여  100     180
1    0   0      0    0       0
2  직장인  영웅      여  300     200

In [49]:
dataDF['height'] = 0
dataDF

  name job gender  age  height
0  홍길동  의적      여  100       0
1    0   0      0    0       0
2  직장인  영웅      여  300       0